In [1]:
%matplotlib inline
%run ./dependencies.py
%run ./utility_functions.py

In [2]:
pd.set_option('display.max_columns', 500)

In [6]:
repo_directory = Path('D:\Kaggle\Titanic_Repo')
code_path = repo_directory / 'Code'
data_path = repo_directory / 'Data'

In [7]:
df = pd.read_csv(data_path / 'train.csv')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Split the whole available data into a training set and a test set. Do not involve the test set in the training procedure, but apply pre-processing (i.e. get rid of missing values, encode categorical variables, etc.)

In [42]:
df_train, df_test = split_training_set(df, 0.1)
print('The training data contains {0} columns and {1} rows'.format(df_train.shape[1], df_train.shape[0]))
print('The test data contains {0} columns and {1} rows'.format(df_test.shape[1], df_test.shape[0]))

The training data contains 12 columns and 802 rows
The test data contains 12 columns and 89 rows

Pre-Processing

The following utility functions may be applied: 
encode_categorical_vars() --- to transform categorical variables to numerical ones via the dummy variable approach

In [43]:
#Encode Sex and Embarked variables
df_train = encode_categorical_vars(df_train, ['Sex', 'Embarked'])
#Set mean for 'NaN' fields in Age
df_train['Age'].fillna(df_train['Age'].mean(), inplace = True)

In [44]:
#mutiplied Age gives different accuracy
df_train['Age_multiplied'] = df_train['Age']/1000

In [45]:
df_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Age_multiplied
250,251,0,3,"Reed, Mr. James George",male,29.750657,0,0,362316,7.2500,NaN,S,0,1,0,0,1,0.029751
165,166,1,3,"Goldsmith, Master. Frank John William ""Frankie""",male,9.000000,0,2,363291,20.5250,NaN,S,0,1,0,0,1,0.009000
541,542,0,3,"Andersson, Miss. Ingeborg Constanzia",female,9.000000,4,2,347082,31.2750,NaN,S,1,0,0,0,1,0.009000
625,626,0,1,"Sutton, Mr. Frederick",male,61.000000,0,0,36963,32.3208,D50,S,0,1,0,0,1,0.061000
388,389,0,3,"Sadlier, Mr. Matthew",male,29.750657,0,0,367655,7.7292,NaN,Q,0,1,0,1,0,0.029751
76,77,0,3,"Staneff, Mr. Ivan",male,29.750657,0,0,349208,7.8958,NaN,S,0,1,0,0,1,0.029751
281,282,0,3,"Olsson, Mr. Nils Johan Goransson",male,28.000000,0,0,347464,7.8542,NaN,S,0,1,0,0,1,0.028000
712,713,1,1,"Taylor, Mr. Elmer Zebley",male,48.000000,1,0,19996,52.0000,C126,S,0,1,0,0,1,0.048000
338,339,1,3,"Dahl, Mr. Karl Edwart",male,45.000000,0,0,7598,8.0500,NaN,S,0,1,0,0,1,0.045000
327,328,1,2,"Ball, Mrs. (Ada E Hall)",female,36.000000,0,0,28551,13.0000,D,S,1,0,0,0,1,0.036000

All pre-processing done? Then proceed with the training procedure

Sample usage (copy the following line in a new cell):
training_example = training_proc(df_train,['Survived', 'Pclass', 'Fare'])

In [48]:
#Standard train
training_example = training_proc(df_train,['Survived', 'Pclass', 'Age','Fare', 'Sex_female', 'Sex_male', 
                                           'Embarked_C', 'Embarked_Q', 'Embarked_S'])

Your dataframe is formally correct. Continue with the training routine.


XgBoost:
Model with rank 1
Mean Accuracy score: 0.8267 (sd: 0.0142)

Random Forest:
Model with rank 1
Mean Accuracy score: 0.8155 (sd: 0.0151)

ANN:
Model with rank 1
Mean Accuracy score: 0.7531 (sd: 0.0261)

In [41]:
#Experimental train with multiplied Age
training_example = training_proc(df_train,['Survived', 'Pclass', 'Age_multiplied','Fare', 
                                           'Sex_female', 'Sex_male', 'Embarked_C', 'Embarked_Q', 'Embarked_S'])

Your dataframe is formally correct. Continue with the training routine.


XgBoost:
Model with rank 1
Mean Accuracy score: 0.8254 (sd: 0.0150)

Random Forest:
Model with rank 1
Mean Accuracy score: 0.8130 (sd: 0.0264)

ANN:
Model with rank 1
Mean Accuracy score: 0.7756 (sd: 0.0258)
Model with rank 1
Mean Accuracy score: 0.7756 (sd: 0.0258)

Apply the fitted estimators to the test data

Sample usage:
test_proc(df_test, ['Survived', 'Pclass', 'Fare'], training_example)